package com.example.pizzarecipes;

public class Utils {
    public static final String PIZZA_1_TITLE = "Пицца «Маргарита» в духовке";
    public static final String PIZZA_1_DESCRIPTION = "Чтобы обычная духовка справилась с пиццей, понадобится правильно приготовленное дрожжевое тесто. Рецепт этот хорош тем, что ингредиенты для «Маргариты» почти всегда есть под рукой. ";
    public static final String PIZZA_1_RECIPE = "ШАГ 1\n" +
            "В небольшую миску раскрошить свежие дрожжи и смешать венчиком с небольшим количеством тёплой воды. Сухие дрожжи, в миску просеять муку, добавить сухие дрожжи и перемешать, жобавить немного тёплой воды и замесить тество подливая по необходимости воду. Накрыть миски чистым кухонным полотенцем и оставить на время в тёплом месте, пока дрожжи не поднимуться.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Добавить соль, оливковое масло (10 мл) и вымешивать тесто 15 минут. Можно это делать или руками, или миксером с насадкой крюком (во втором случае будет быстрее). Тесто должно получиться мягким, прилипать к рукам, но при этом при нажатии восстанавливаться. Присыпав руки мукой, сформировать из теста шар, выложить в хорошо присыпанную мукой миску (чтобы тесто не прилипло), затянуть пленкой и убрать в холодильник на сутки. Достать тесто, обмять и разделить на шесть частей. Скатать каждую часть снова в шар, выложить на присыпанный мукой противень и снова убрать в холодильник часов на 6 или на 1,5 часа оставить при комнатной температуре.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Приготовить начинку. В томатный соус из банки добавить оливковое масло, посолить, поперчить. Моцареллу поместить на сито и дать стечь лишней жидкости. Затем нарезать ее крупными ломтиками.\n" +
            "\n" +
            "ШАГ 4\n" +
            "Перед выпеканием пиццы убрать в духовку перевернутый противень. Включить максимальную мощность — если ваша духовка поддерживает температуру меньше 270 градусов, то при выпекании пиццы нужно будет включить конвекцию. Заняться пиццей: шарик теста выложить на присыпанную мукой доску. Расплющить его в лепешку, а потом руками сформировать корж, начиная с середины: бортики должны быть толстыми, а середина — тонкой. Ладонями растянуть корж аккуратными движениями изнутри наружу до диаметра 30 см.\n" +
            "\n" +
            "ШАГ 5\n" +
            "Аккуратно переложить корж на лопату или любую плоскую поверхность, на которой вы потом можете поместить пиццу в духовку. Смазать поверхность теста томатным соусом, сверху выложить порванную на куски руками или крупно нарезанную моцареллу и несколько листиков базилика. Аккуратно переложить пиццу на раскаленный противень в духовке. Выпекать 3–5 минут, в зависимости от толщины теста и мощности духовки. Когда соус на пицце загустеет, моцарелла слегка «поплывет», а бортики интенсивно подрумянятся, достать пиццу из духовки. Съесть немедленно.";

}