package com.example.pizzarecipes;

public class Utils {
    public static final String PIZZA_1_TITLE = "Пицца Маргарита» в духовке";
    public static final String PIZZA_1_DESCRIPTION = "Чтобы обычная духовка справилась с пиццей, понадобится правильно приготовленное дрожжевое тесто. Рецепт этот хорош тем, что ингредиенты для «Маргариты» почти всегда есть под рукой. ";
    public static final String PIZZA_1_RECIPE = "ШАГ 1\n" +
            "В небольшую миску раскрошить свежие дрожжи и смешать венчиком с небольшим количеством тёплой воды. Сухие дрожжи, в миску просеять муку, добавить сухие дрожжи и перемешать, жобавить немного тёплой воды и замесить тество подливая по необходимости воду. Накрыть миски чистым кухонным полотенцем и оставить на время в тёплом месте, пока дрожжи не поднимуться.\n"  +
            "\n" +
            "ШАГ 2\n" +
            "Добавить соль, оливковое масло (10 мл) и вымешивать тесто 15 минут. Можно это делать или руками, или миксером с насадкой крюком (во втором случае будет быстрее). Тесто должно получиться мягким, прилипать к рукам, но при этом при нажатии восстанавливаться. Присыпав руки мукой, сформировать из теста шар, выложить в хорошо присыпанную мукой миску (чтобы тесто не прилипло), затянуть пленкой и убрать в холодильник на сутки. Достать тесто, обмять и разделить на шесть частей. Скатать каждую часть снова в шар, выложить на присыпанный мукой противень и снова убрать в холодильник часов на 6 или на 1,5 часа оставить при комнатной температуре.\n"  +
            "\n" +
            "ШАГ 3\n" +
            "Приготовить начинку. В томатный соус из банки добавить оливковое масло, посолить, поперчить. Моцареллу поместить на сито и дать стечь лишней жидкости. Затем нарезать ее крупными ломтиками.\n" +
            "\n" +
            "ШАГ 4\n" +
            "Перед выпеканием пиццы убрать в духовку перевернутый противень. Включить максимальную мощность — если ваша духовка поддерживает температуру меньше 270 градусов, то при выпекании пиццы нужно будет включить конвекцию. Заняться пиццей: шарик теста выложить на присыпанную мукой доску. Расплющить его в лепешку, а потом руками сформировать корж, начиная с середины: бортики должны быть толстыми, а середина — тонкой. Ладонями растянуть корж аккуратными движениями изнутри наружу до диаметра 30 см.\n" +
            "\n" +
            "ШАГ 5\n" +
            "Аккуратно переложить корж на лопату или любую плоскую поверхность, на которой вы потом можете поместить пиццу в духовку. Смазать поверхность теста томатным соусом, сверху выложить порванную на куски руками или крупно нарезанную моцареллу и несколько листиков базилика. Аккуратно переложить пиццу на раскаленный противень в духовке. Выпекать 3–5 минут, в зависимости от толщины теста и мощности духовки. Когда соус на пицце загустеет, моцарелла слегка «поплывет», а бортики интенсивно подрумянятся, достать пиццу из духовки. Съесть немедленно.";

    public static final String PIZZA_2_TITLE = "Пицца с курицей тикка масала";
    public static final String PIZZA_2_DESCRIPTION = "Приготовьте наши пиццы с курицей и специями, используя хлеб наан, всего за 20 минут. Чтобы сбалансировать температуру, подавайте их с кусочками мангового чатни и натуральным йогуртом";
    public static final String PIZZA_2_RECIPE = "ШАГ 1\n" +
            "Разогрейте духовку до 180 ° С / вентилятор / газ 160С 4. Смешайте красный лук с красным винным уксусом и хорошей щепоткой соли и отложите в сторону (уксус слегка размягчит лук, что является благом, поскольку никто не хочет, чтобы пицца была с полностью сырым луком).\n" +
            "\n" +
            "ШАГ 2\n" +
            "Выложите хлебцы наан на противень, сбрызните небольшим количеством воды, затем поставьте в духовку на 2 минуты для разогрева. Тем временем выложите курицу и перец на сковороду с пастой карри, перемешайте, затем обжаривайте на сильном огне 6-8 минут до готовности.\n" +
            "\n" +
            "ШАГ 3\n" +
            "Достаньте нааны из духовки, намажьте каждую йогуртом, затем сверху выложите курицу, красный лук, зеленый перец чили, кориандр и манговый чатни";

    public static final String PIZZA_3_TITLE = "Веганская пицца Маргарита";
    public static final String PIZZA_3_DESCRIPTION = "Веганам не стоит отказываться от пиццы Маргарита. Наш рецепт сочетает в себе классические вкусы этого итальянского деликатеса с использованием заменителей на растительной основе";
    public static final String PIZZA_3_RECIPE = "ШАГ 1\n" +
            "Положите муку, дрожжи и сахар в большую миску. Отмерьте 150 мл холодной воды и 150 мл кипятка в кувшин и смешайте их вместе – это будет означать, что температура вашей воды подходит для дрожжей. Добавьте масло и 1 ч. л. соли в теплую воду, затем влейте в муку. Хорошо перемешайте ложкой и начинайте замешивать смесь в миске, пока не получится мягкое и слегка липкое тесто. Если она слишком сухая, добавьте немного холодной воды.\n" +
            "\n" +
            "ШАГ 2\n" +
            "Посыпьте рабочую поверхность небольшим количеством муки и месите тесто в течение 10 минут. Выложите его обратно в миску для замешивания и накройте пищевой пленкой, смазанной несколькими каплями оливкового масла. Оставьте подниматься в теплом месте на 1 час или пока она не увеличится вдвое.\n" +
            "\n" +
            "STEP 3\n" +
            "Heat oven to 220C/200C/gas 9 and put a baking sheet or pizza stone on the top shelf to heat up. Once the dough has risen, knock it back by punching it a couple of times with your fist then kneading it again on a floured surface. It should be springy and a lot less sticky. Set aside while you prepare the sauce.\n" +
            "\n" +
            "STEP 4\n" +
            "Put all the ingredients for the tomato sauce together in a bowl, season with salt, pepper and a pinch of sugar if you like and mix well. Set aside until needed.\n" +
            "\n" +
            "ШАГ 5\n" +
            "Разделите тесто на 2 или 4 части (в зависимости от того, хотите ли вы приготовить большую или маленькую пиццу), сформуйте шарики и расплющите каждый кусочек как можно тоньше скалкой или руками. Убедитесь, что тесто хорошо посыпано мукой, чтобы оно не прилипало. Посыпьте другой противень мукой, затем выложите основу для пиццы – намажьте 4-5 ст. л. томатного соуса, добавьте нарезанные помидоры и тертый веганский сыр. Сбрызните небольшим количеством оливкового масла и запекайте в духовке на предварительно разогретом противне в течение 10-12 минут или до тех пор, пока основа не распухнет, а веганский сыр не начнет пузыриться и покрываться золотистыми вкраплениями.\n" +
            "\n" +
            "ШАГ 6\n" +
            "Повторите с остальным тестом и посыпкой. Подавайте пиццу со свежими листьями базилика или маслом чили, если хотите, и посыпьте веганским пармезаном сразу после выпечки.";

}